In [1]:
import pandas as pd
df = pd.read_csv('titanic.csv')

In [2]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis='columns', inplace=True)

In [4]:
df

     Pclass     Sex   Age     Fare  Survived
0         3    male  22.0   7.2500         0
1         1  female  38.0  71.2833         1
2         3  female  26.0   7.9250         1
3         1  female  35.0  53.1000         1
4         3    male  35.0   8.0500         0
..      ...     ...   ...      ...       ...
886       2    male  27.0  13.0000         0
887       1  female  19.0  30.0000         1
888       3  female   NaN  23.4500         0
889       1    male  26.0  30.0000         1
890       3    male  32.0   7.7500         0

[891 rows x 5 columns]

In [5]:
target = df.Survived

In [6]:
inputs = df.drop('Survived', axis='columns')

In [7]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [8]:
inputs = pd.concat([inputs, dummies], axis='columns')

In [9]:
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [10]:
inputs.drop('Sex', axis='columns', inplace=True)

In [12]:
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [14]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [15]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

In [16]:
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [17]:
from sklearn.model_selection import train_test_split

In [24]:
X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size=0.2)

In [25]:
len(X_train)

712

In [26]:
len(y_train)

712

In [27]:
len(X_test)

179

In [28]:
len(y_test)

179

In [29]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [30]:
model.fit(X_train, y_train)

GaussianNB()

In [31]:
model.score(X_test, y_test)

0.776536312849162

In [33]:
X_test[:10]

     Pclass        Age      Fare  female  male
334       1  29.699118  133.6500       1     0
881       3  33.000000    7.8958       0     1
571       1  53.000000   51.4792       1     0
861       2  21.000000   11.5000       0     1
123       2  32.500000   13.0000       1     0
230       1  35.000000   83.4750       1     0
787       3   8.000000   29.1250       0     1
118       1  24.000000  247.5208       0     1
510       3  29.000000    7.7500       0     1
80        3  22.000000    9.0000       0     1

In [34]:
y_test[:10]

334    1
881    0
571    1
861    0
123    1
230    1
787    0
118    0
510    1
80     0
Name: Survived, dtype: int64

In [35]:
model.predict(X_test[:10])

array([1, 0, 1, 0, 1, 1, 0, 1, 0, 0], dtype=int64)

In [36]:
model.predict_proba(X_test[:10])

array([[1.33363829e-05, 9.99986664e-01],
       [9.91134263e-01, 8.86573673e-03],
       [4.76245546e-03, 9.95237545e-01],
       [9.75888153e-01, 2.41118466e-02],
       [4.16706562e-02, 9.58329344e-01],
       [1.22122223e-03, 9.98778778e-01],
       [9.80447321e-01, 1.95526785e-02],
       [8.04671691e-11, 1.00000000e+00],
       [9.90800464e-01, 9.19953649e-03],
       [9.89563763e-01, 1.04362374e-02]])